[
  {
    "content" : "A massive haul of Widgy widgets added today. All designed and created by DaddyKool. Check them out in the shop, all for free! ",
    "title" : "New Widgy Widgets",
    "date" : "2024-09-10"
  },
  {
    "title" : "Spendr App Is out Now!",
    "date" : "2024-08-30",
    "content" : "Check out my budgeting app Spendr now on the AppStore. "
  },
  {
    "title" : "New Website! ",
    "content" : "I’ve launched a new website that houses all my iOS apps in one place. I have a few more apps to add to my portfolio, but my latest creations, ClipM and StatCoach, are already available. Take a look at my website at showcreative.co.uk.",
    "date" : "2024-08-16"
  },
  {
    "content" : "57 beautiful art style wallpapers added to my wallpaper section. Go check them out! ",
    "date" : "2024-08-13",
    "title" : "Loads Of Art Style Wallpapers Added "
  },
  {
    "date" : "2024-07-10",
    "title" : "New App ClipM",
    "content" : "I’m currently working on my newest project for iOS ‘ClipM’ clipboard manager. Easily save and document your clipboard by adding a title, comment and image. Create and add categories for filtering later. All in a beautiful UI. Coming soon! "
  },
  {
    "title" : "Flap M Game",
    "content" : "In the next update I’ve added a surprise for everyone who has unlocked premium and added a Flappy Bird style game called Flap M. Compete against fellow players and submit your score to be featured on the leaderboard! Coming soon!",
    "date" : "2024-07-04"
  },
  {
    "date" : "2024-07-01",
    "title" : "Test 16:01",
    "content" : "Please ignore. Sorry for the inconvenience! "
  },
  {
    "title" : "Update - 01 July 2024",
    "date" : "2024-07-01",
    "content" : "I’m busy working on lots of new features and improvements. Specifically ensuring iOS 18 compatibility. You may see some unexpected behaviour from M whilst I test some new code. "
  },
  {
    "content" : "The latest app update is out now in the Appstore. Lots of new features and changes in this one. I hope you like it! as always feel free to contact me on twitter with any ideas or suggestions you have for M",
    "date" : "2024-06-08",
    "title" : "Update - 08 June 2024"
  },
  {
    "title" : "Update - 31 May 2024",
    "content" : "Ive just added 11 amazing icon packs by the very talented @bulldog5278 Aka Scott to the Ⓜ shop. All completely free! Be sure to check them out and give Scott a shout out on X",
    "date" : "2024-05-31"
  },
  {
    "content" : "The new version of M has been approved and will be on the App Store soon with many updates. Remember to feel free to share any feature requests on Twitter, I do listen!",
    "title" : "Update - 30 May 2024",
    "date" : "2024-05-30"
  },
  {
    "date" : "2024-05-22",
    "content" : "2 new wallpaper packs added to the Ⓜ shop, 3DCurvature & VibrantAb by SeanKly. Only 2 tokens each. Also in this news update, the latest update is on the Appstore and features a brand new app icon picker and wallpaper filter. Update on the appstore if you havent already!",
    "title" : "Update(2) - 22 May 2024"
  },
  {
    "content" : "2 new wallpaper packs added to the Ⓜ shop, Refraction & Vintage Scenery by SeanKly. Only 2 tokens each.",
    "title" : "Update(2) - 21 May 2024",
    "date" : "2024-05-21"
  },
  {
    "date" : "2024-05-21",
    "content" : "5 Amazing icon packs by @DahlinKawika have just been added to the Ⓜ shop, and they’re absolutely free to everyone who has unlocked the shop!",
    "title" : "Update - 21 May 2024"
  },
  {
    "date" : "2024-05-17",
    "title" : "Update - 17 May 2024",
    "content" : "I've just added an exclusive, dark, and moody wallpaper pack titled - Sweeping Dark to the M shop, available now for only 2 tokens. Additionally, I'm working on an incremental update to M, which will enhance the scrolling experience in the wallpaper sections."
  },
  {
    "content" : "21 Beautiful warm and rich walnut and other rare species wood wallpapers added the the M Shop. Some new Wigy Widgets inbound too!",
    "date" : "2024-05-03",
    "title" : "Update - 03 May 2024"
  },
  {
    "title" : "Update - 02 May 2024",
    "content" : "Good news if you have unlocked the shop! I have just added 22 Icon packs from the very talented icon creator kyawthihaphyo aka Thiha and all for FREE if you have unlocked the shop!",
    "date" : "2024-05-02"
  },
  {
    "title" : "Update - 01 May 2024",
    "date" : "2024-05-01",
    "content" : "Im working on the next update of M and hope to have it released before I finish for two weeks holiday. Dont worry there will still be new content addded by our other very talented creators."
  },
  {
    "title" : "Update - 27 Apr 2024",
    "content" : "The next update has been submitted to the Appstore. This update includes two new icons, items totals count in the shop for each category and finally the ability to use URL schemes to open and share wallpapers with other M app users.",
    "date" : "2024-04-27"
  },
  {
    "title" : "Update - 19 Apr 2024",
    "content" : "I have listened to your feedback relating to the latest update and i have already made a few changes. The main one being that you will be able to browse the shop before unlocking it. You will still need to unlock the shop before being able to download any items. I am waiting on Apple approving my submission. Thanks for your continued support.",
    "date" : "2024-04-19"
  },
  {
    "date" : "2024-04-19",
    "title" : "Update - 19 Apr 2024",
    "content" : "The latest update is live with a new shop section, SWA Custom mockup, revamped settings with news, and UI enhancements. Unlock the shop in settings. There is loads more shop content coming soon. As always thanks for your continued support."
  },
  {
    "content" : "Get ready to elevate your experience with M App! I’ve got a limited stash of 5 premium codes up for grabs! Visit me on Twitter (or X), you can find my link in settings, drop a like, and leave a comment to secure your chance at unlocking exclusive perks!",
    "title" : "Update - 11 Apr 2024",
    "date" : "2024-04-11"
  },
  {
    "date" : "2024-03-28",
    "content" : "I’m excited to share that I’m currently working on an upcoming update, which will introduce a new shop section! This addition will encompass Wallpaper packs, weather icon packs, icon packs, and Widgy widgets, all conveniently available in one place. While I’m dedicated to bringing this update to life, it’s important to acknowledge that I have other commitments, including a full-time job. While I can’t commit to a specific release date, rest assured, progress is underway, and I appreciate your patience and support as I strive to deliver the best experience possible. Stay tuned for further updates and sneak peeks ;)",
    "title" : "Update - 28 Mar 2024"
  },
  {
    "date" : "2024-03-14",
    "content" : "Great news for iPhone 12 Pro, 12, 13 Pro, 13, and 14 users! I've just rolled out updates to the effects in the creator section tailored specifically for these devices. Now, you can enjoy enhanced features such as icon shadows, widget shadows, and shelf effects. I hope you find these additions enjoyable! Should you encounter any issues, please don't hesitate to reach out. You can find my contact details located in the settings section.",
    "title" : "Update - 14 Mar 2024"
  },
  {
    "title" : "Update - 10 Mar 2024",
    "date" : "2024-03-10",
    "content" : "Hello and welcome to the new version M! I hope you are enjoying the new UI and find it much easier to navigate your way around. I would really appreciate if you could spare a minute to review the app on the AppStore and leave a 5 star review. It really helps the app. Thanks! "
  }
]